%15 цифр - стоимость перевозок, остальные отвечают за стоимость рекламных акций 
c=[6; 8; 9; 7; 5; 6; 8; 10; 8; 7; 6; 7; 9; 5; 5; 1; 1; 1; 1; 1; 0; 0; 0; 0; 0];
%левая часть матрицы ограничений 
a=[1 1 1 1 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0;
0 0 0 0 0 1 1 1 1 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0;
0 0 0 0 0 0 0 0 0 0 1 1 1 1 1 0 0 0 0 0 0 0 0 0 0;
1 0 0 0 0 1 0 0 0 0 1 0 0 0 0 0 0 0 0 0 -1 0 0 0 0;
0 1 0 0 0 0 1 0 0 0 0 1 0 0 0 0 0 0 0 0 0 -1 0 0 0;
0 0 1 0 0 0 0 1 0 0 0 0 1 0 0 0 0 0 0 0 0 0 -1 0 0;
0 0 0 1 0 0 0 0 1 0 0 0 0 1 0 0 0 0 0 0 0 0 0 -1 0;
0 0 0 0 1 0 0 0 0 1 0 0 0 0 1 0 0 0 0 0 0 0 0 0 -1;
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 1 1;
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 -0.5 0 0 0 0 1 0 0 0 0;
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 -0.4 0 0 0 0 1 0 0 0 0;
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 -0.3 0 0 0 0 1 0 0 0 0;
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 -0.3 0 0 0 0 1 0 0 0;
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 -0.2 0 0 0 0 1 0 0 0;
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 -0.1 0 0 0 0 1 0 0 0;
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 -0.6 0 0 0 0 1 0 0;
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 -0.5 0 0 0 0 1 0 0;
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 -0.4 0 0 0 0 1 0 0;
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 -0.5 0 0 0 0 1 0;
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 -0.4 0 0 0 0 1 0;
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 -0.3 0 0 0 0 1 0;
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 -0.4 0 0 0 0 1;
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 -0.3 0 0 0 0 1;
0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 -0.2 0 0 0 0 1];
%правая часть матрицы ограничений 
b=[123; 104; 133; 28; 60; 42; 44; 28; 158; 0; 4; 14; 0; 4; 14; 0; 4; 14; 0; 4; 14; 0; 4; 14];
%знаки матрицы ограничений (S=, u <=
ctype="SSSSSSSSSUUUUUUUUUUUUUUU";

vartype="IIIIIIIIIIIIIIIIIIIIIIIII";

sense=1;

%задание 1
[xmin, fmin, error_code]=glpk(c, a, b, [], [], ctype, vartype, sense)

%задание 2
izd=[0; 0; 0; 0; 0; 0; 0; 0; 0; 0];

money=[1; 2; 3; 4; 5; 6; 7; 8; 9; 10];

for i=1 : 10
c(8)=i;
[xmin, fmin, status]=glpk(c, a, b, [], [], ctype, vartype, sense);
if status==0
  izd(i)=fmin;
izd(i)
end;
end
plot(money,izd);

%задание 3
tovar=[0; 0; 0; 0; 0; 0; 0; 0; 0; 0];
money=[1; 2; 3; 4; 5; 6; 7; 8; 9; 10];
for i=1 : 10
c(8)=i;
[xmin, fmin, status]=glpk(c, a, b, [], [], ctype, vartype, sense);
if status==0
tovar(i)=xmin(8);
tovar(i)
end;
end

plot(money,tovar);