%коэффиценты перед неизвестными функции цели
c = [150, 150, 350,200,100];
%матрицы ограничений
a=[1 1 1 0 0;
1 1 1 1 0;
0 1 1 1 0;
0 1 1 1 1;
1 1 1 1 0;
1 1 1 1 0;
1 1 1 1 1;
0 1 1 1 1;
1 1 1 1 0;
1 1 1 1 1;
1 1 1 1 1;
1 0 1 1 1;
1 1 1 1 1;
1 0 1 1 1;
0 0 1 1 1];
%правая часть матрицы ограничений 
b=[1; 1; 1; 1; 1; 1; 1; 1; 1; 1; 1; 1];
%знаки в матрице ограничений (L >=)
ctype="LLLLLLLLLLLL";
%искомые значения - целые 
vartype="IIIII";
%задача на минимум
sense=1;

[xmin, fmin, error_code, extra ]=glpk(c, a, b, [0; 0; 0; 0; 0], [1; 1; 1; 1; 1], ctype, vartype, sense)